[
	{
		"id": "jordi-de-leeuw-alice-in-wonderland",
		"nameStudent": "Jordi De Leeuw",
		"fairytale": "Alice in Wonderland",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-JordiDeLeeuw/#/fairytale",
		"fairytaleAuthor": "Lewis Carroll",
		"parallaxInfo": "Voor mijn parallax-ervaring liet ik me inspireren door de K3-musicalversie van 'Alice in Wonderland'. Die vormde de creatieve basis waardoor ik ook vijf fragmenten uit hun versie van het sprookje gebruikt als audio-ondersteuning in verschillende scènes. In totaal bestaat de ervaring uit vijf scènes die elk gebruikmaken van verschillende visuele en interactieve technieken. \nZo heb ik een horizontale scroll gecreëerd om het gevoel van beweging en avontuur te versterken. Daarnaast zorgen rotatie-effecten voor een vervreemdende sfeer. Er zijn interactieve knoppen toegevoegd waarmee de gebruiker invloed kan uitoefenen op wat er gebeurt. In een van de scènes verschijnt ook een 3D-model van een horloge. Verder is er een element dat je kan verslepen, waardoor de beleving nog tastbaarder aanvoelt. Tot slot is er een afbeelding verwerkt die fungeert als ontsnappingsmechanisme: wanneer je daarop klikt, word je terug naar het begin als symbool voor het ontwaken.",
		"description": "Alice ziet een wit konijn voorbij rennen en besluit hem nieuwsgierig te volgen, recht de weide door. Zonder het te beseffen valt ze in een diepe put, en zo begint haar reis naar een wereld vol verwarring en verwondering. In een vreemde kamer vol deuren ontdekt ze magisch eten en drinken dat haar doet groeien en krimpen. Verderop belandt ze aan een chaotisch theefeest bij de Gekke Hoedenmaker, waar logica niet lijkt te bestaan. Maar de vrolijke waanzin slaat snel om, wanneer de dreiging van de Boze Koningin haar wereld binnendringt. Gelukkig was het allemaal maar een droom!",
		"videoExplainer": "M9yxLSC8ysY",
		"imgThumbnail": "https://res.cloudinary.com/dici5riux/image/upload/promo_sesqtp",
		"imgBanner": "https://res.cloudinary.com/dici5riux/image/upload/banner2_kz0wno",
		"imgsExtra": ["https://res.cloudinary.com/dici5riux/image/upload/square_twins_goaiux", "https://res.cloudinary.com/dici5riux/image/upload/sqauremirror_bsdhd6", "https://res.cloudinary.com/dici5riux/image/upload/squarepocketwatch_b8t8lz"],
		"imgsInfo": "Voor mijn visuele stijl heb ik gekozen voor een zachte, Victoriaanse aquarelsfeer, geïnspireerd op 19e-eeuwse sprookjesillustraties. De afbeeldingen kenmerken zich door fijne lijnen, vervloeiende pastelkleuren en dromerige composities die een nostalgisch en magisch gevoel oproepen. Elk beeld straalt een zekere rust en verfijning uit, terwijl de sprookjesachtige elementen, zoals een konijn, pratende dieren en fantasierijke kostuums, het geheel tot leven brengen. \nOm deze stijl te realiseren, heb ik gebruikgemaakt van de beeldgenerator GPT, ontwikkeld door Naif Alotaibi. Deze AI-tool gaf me de vrijheid om mijn visie nauwkeurig en consistent in beeld om te zetten.",
		"genre": "avontuur",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "pema-bhutia-coraline",
		"nameStudent": "Pema Bhutia",
		"fairytale": "Coraline",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-PemaBhutia2005/parallax",
		"fairytaleAuthor": "Neil Gaiman",
		"parallaxInfo": "Op mijn parallax-pagina maak ik vooral gebruik van scroll gestuurde animaties. Bewegingen van afbeeldingen (zoals huizen, portretten en figuren) worden subtiel aangepast op basis van de scrollpositie om diepte te simuleren. Daarnaast zijn er interactieve elementen: wanneer je met de muis over een portaal of bepaalde afbeeldingen beweegt, verschijnen verborgen boodschappen of verandert de visuele sfeer, wat bijdraagt aan de spanning en ontdekking.",
		"description": "Coraline verhuist naar een nieuw appartement met haar drukke ouders maar voelt zich verwaarloosd en verveeld. Terwijl ze haar omgeving verkent, ontdekt ze een mysterieuze deur die naar een alternatieve versie van haar huis leidt. In deze Andere Wereld lijkt alles levendiger en ontmoet ze haar Andere Moeder, die knoopogen heeft en haar een schijnbaar perfect leven biedt. Coraline beseft echter al snel dat de Andere Moeder sinistere bedoelingen heeft en haar voor altijd gevangen wil houden. Coraline is vastbesloten om te ontsnappen een weg terug te vinden naar haar eigen wereld.",
		"videoExplainer": "",
		"imgThumbnail": "https://res.cloudinary.com/ddyh6ryvx/image/upload/thumbnail_wlxraz",
		"imgBanner": "https://res.cloudinary.com/ddyh6ryvx/image/upload/banner_mz2s61",
		"imgsExtra": [
			"https://res.cloudinary.com/ddyh6ryvx/image/upload/Firefly_a_family_consisting_of_a_mom_dad_and_a_daughter_arriving_at_their_newly_bought_house_in_a_c_ek0rqk",
			"https://res.cloudinary.com/ddyh6ryvx/image/upload/AGOTHI_1_lmtswv",
			"https://res.cloudinary.com/ddyh6ryvx/image/upload/AGOTHI_4_rim9j6"
		],
		"imgsInfo": "De beelden zijn geïnspireerd op vintage gotische illustraties uit het Victoriaanse tijdperk. Ze hebben een sprookjesachtig maar onheilspellend karakter, met gedempte kleuren, grove lijnen en een sfeer die lichtjes ongemakkelijk aanvoelt. Deze stijl creëert het gevoel van een oud verhaalboek dat tot leven komt — betoverend, maar met een duistere rand.",
		"genre": "horror",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "sophia-rahmoun-roodkapje",
		"nameStudent": "Sophia Rahmoun",
		"fairytale": "Roodkapje",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-SophiaRahmoun/fairytale",
		"fairytaleAuthor": "Charles Perrault / De Gebroeders Grimm.",
		"parallaxInfo": "Voor mijn parallax-ervaring koos ik ervoor om het verhaal van Roodkapje met een duistere twist te vertellen. Ik gebruikte verschillende soorten parallax om een ​​meeslepender gevoel te creëren. Aan het begin is er een gelaagde parallax: de bosachtergrond beweegt met verschillende snelheden wanneer je scrolt, wat een dromerige intro-sfeer geeft. \nWanneer de gebruiker vervolgens op het mandje klikt, verschijnt er een verborgen hand aan de zijkant, een soort muisgestuurde parallax. Het verhaal gaat verder met een horizontale parallax waarbij het meisje (geanimeerd in GIF) langzaam door het bos loopt terwijl je scrolt. Later kun je zelf de struik verslepen om de wolf erachter te ontdekken, wat de scène interactiever maakt. \nSommige delen van de tekst vervagen tijdens het scrollen, wat een meer standaard verticaal parallax-effect toevoegt. Ik heb ook zelf een aantal scènes getekend en er frame voor frame animaties van gemaakt om het een meer handgemaakte en griezelige sfeer te geven. Je verwacht niet echt hoe het eindigt, en dat is juist de bedoeling.",
		"description": "Roodkapje is een sprookje over een jong meisje dat een rode mantel draagt en onderweg naar haar wachtende grootmoeder een wolf tegenkomt. Afhankelijk van de versie van het verhaal wordt het meisje door de wolf opgegeten of gered door een boswachter of jager.",
		"videoExplainer": "",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-SophiaRahmoun/assets/cover_sophia.jpg",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-SophiaRahmoun/assets/banner_sophia.jpg",
		"imgsExtra": [
			"https://ehb-mct.github.io/cp-frontend-SophiaRahmoun/assets/extra1_sophia.png",
			"https://ehb-mct.github.io/cp-frontend-SophiaRahmoun/assets/extra2_sophia.jpg",
			"https://ehb-mct.github.io/cp-frontend-SophiaRahmoun/assets/extra3_sophia.jpg"
		],
		"imgsInfo": "Voor de beelden heb ik gekozen voor een duistere sprookjesachtige sfeer, een beetje met de hand getekend en sfeervol. Ik heb een aantal afbeeldingen zelf getekend en er frame voor frame geanimeerde GIF's van gemaakt, om het die ouderwetse sprookjessfeer te geven. De kleuren zijn diep en dramatisch, met veel contrast, passend bij de spookachtige bossfeer. \nIk heb dat gecombineerd met door AI gegenereerde afbeeldingen om het geheel consistent maar toch creatief te houden. De stijl voelt een beetje vintage aan, maar ook speels en mysterieus, net als het verhaal.",
		"genre": "fantasie",
		"storyFrom": "Gebroeders Grimm"
	},
	{
		"id": "wout-van-impe-blauwbaard",
		"nameStudent": "Wout Van Impe",
		"fairytale": "Blauwbaard",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-WoutVanImpe/#/fairytale",
		"fairytaleAuthor": "Charles Perrault",
		"parallaxInfo": "Voor dit project heb ik een klassieke vertelling vertaald naar een interactieve beleving met parallax scrolling. Door meerdere lagen visueel te scheiden en met verschillende snelheden te bewegen tijdens het scrollen, creëert de parallax een dieptegevoel en meer dynamiek in de scenes. Met Framer Motion heb ik vloeiende animaties toegevoegd om acties als het openen van deuren, het bewegen van personages en het verschijnen van teksten soepel te laten verlopen. Zo ontstaat een meeslepende en visueel rijke ervaring die de gebruiker door het verhaal leidt zonder de browser te verlaten.",
		"description": "Blauwbaard is een duister sprookje vol mysterie en verboden geheimen. Het gaat over een rijk, maar zonderlinge edelman met een blauwe baard die al meerdere keren getrouwd is geweest, maar niemand weet wat er met zijn vorige vrouwen is gebeurd. Wanneer hij opnieuw trouwt, geeft hij zijn jonge bruid de sleutels van zijn kasteel, met één strikte regel: één kamertje mag ze nooit betreden. De verleiding blijkt te groot, en achter die verboden deur ontdekt ze een huiveringwekkend geheim… het lot van haar voorgangsters. Wanneer Blauwbaard haar daad ontdekt, dreigt ook zij zijn volgende slachtoffer te worden. Maar kan ze hem nog op tijd ontvluchten? ",
		"videoExplainer": "A05qqii6tmQ",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-WoutVanImpe/thumbnail.png",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-WoutVanImpe/banner.png",
		"imgsExtra": [
			"https://ehb-mct.github.io/cp-frontend-WoutVanImpe/extra1.png",
			"https://ehb-mct.github.io/cp-frontend-WoutVanImpe/extra2.png",
			"https://ehb-mct.github.io/cp-frontend-WoutVanImpe/extra3.png",
			"https://ehb-mct.github.io/cp-frontend-WoutVanImpe/extra4.png"
		],
		"imgsInfo": "De beelden voor dit project zijn gecreëerd met Adobe Firefly en geïnspireerd op een woodcut-achtige, middeleeuwse en vintage horrorstijl. Ze combineren scherpe, grove lijnen met een donker, sfeervol palet om een authentiek middeleeuws gevoel op te roepen. Deze visuele stijl versterkt de mystiek en het onheilspellende karakter van het verhaal, waardoor de scenes aanvoelen als oude houtsneden uit een vergeten griezelvertelling.",
		"genre": "horror",
		"storyFrom": "Charles Perrault"
	},
	{
		"id": "sam-hoeterickx-de-wolf-en-de-3-biggetjes",
		"nameStudent": "Sam Hoeterickx",
		"fairytale": "De wolf en de 3 biggetjes",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-Sam-Hoeterickx/#/fairy-tale",
		"fairytaleAuthor": "Joseph Jacobs.",
		"parallaxInfo": "Voor dit project heb ik dit klassieke verhaal omgezet in een interactieve 3D-ervaring die rechtstreeks in de browser te beleven is. Met behulp van Three.js, React Three Fiber en React Three Drei kon ik de wereld van de drie biggetjes op een visueel aantrekkelijke manier tot leven brengen. \nOm de scènes extra dynamiek te geven, heb ik gebruikgemaakt van GSAP voor vloeiende animaties en overgangen. Het project was een leerzame uitdaging waarin ik storytelling, creatieve vormgeving en technische webontwikkeling heb gecombineerd om een meeslepende digitale vertelling te realiseren.",
		"description": "De Wolf en de Drie Biggetjes” is een klassiek sprookje dat draait om drie kleine biggen die elk een eigen huisje bouwen om zich te beschermen tegen een gevaarlijke wolf. De eerste big bouwt een huis van stro, de tweede een huis van hout, en de derde een stevig huis van bakstenen. Wanneer de grote boze wolf verschijnt, probeert hij de biggen op te eten. Hij blaast het stro- en houten huis omver zonder moeite, waardoor de eerste twee biggen moeten vluchten naar het stenen huis van hun broer. Maar hoe hard de wolf ook blaast, het stenen huis blijft stevig staan. Uiteindelijk geeft de wolf op of wordt hij op slinkse wijze verslagen (afhankelijk van de versie). \nHet verhaal eindigt met de overwinning van slimheid, voorbereiding en hard werken over luiheid en gemakzucht.",
		"videoExplainer": "m_QD2G-VHYo",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-Sam-Hoeterickx/images/fairytale/tumbnail.png",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-Sam-Hoeterickx/images/fairytale/Banner_image.png",
		"imgsExtra": [
			"https://ehb-mct.github.io/cp-frontend-Sam-Hoeterickx/images/fairytale/extra_image_1.png",
			"https://ehb-mct.github.io/cp-frontend-Sam-Hoeterickx/images/fairytale/extra_image_2.png",
			"https://ehb-mct.github.io/cp-frontend-Sam-Hoeterickx/images/fairytale/extra_image_3.png"
		],
		"imgsInfo": "Deze 3D-modellen zijn ontworpen als visuele elementen binnen een interactieve vertelling van de drie biggetjes.",
		"genre": "avontuur",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "rayan-arssi-de-kleine-zeemeermin",
		"nameStudent": "Rayan Arssi",
		"fairytale": "De kleine zeemeermin",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-rayanarssi/parallax",
		"fairytaleAuthor": "Hans Christian Andersen",
		"parallaxInfo": "Across my website, I often use multidirectional parallax effects where various illustrations appear on screen from different angles. In the second scene, I have also added a drag feature that allows users to move elements, specifically the fish, to help them escape the shark. Further down the page, I have implemented hover effects, such as tentacles emerging when you hover over a potion, with a witch spell playing in the background. Towards the end, there is also a 'no' button that disappears when hovered over. In the final scene, the mermaid changes from a playful expression to a crying one using a combination of transform and delay.",
		"description": "Een jonge zeemeerminprinses verlangt naar een leven aan gene zijde van de zee. Ze sluit een gevaarlijk Faustiaans pact met een zeemeermin. Ze ruilt haar stem voor de kans om mens te worden en de liefde te winnen van een prins die ze in het geheim van een afstandje bewondert.",
		"videoExplainer": "SSHM9fBaBWQ",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-rayanarssi/assets/thumbnail.png",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-rayanarssi/assets/Banner.png",
		"imgsExtra": ["https://ehb-mct.github.io/cp-frontend-rayanarssi/assets/Extra_image_1.jpg", "https://ehb-mct.github.io/cp-frontend-rayanarssi/assets/Extra_image_2.jpg", "https://ehb-mct.github.io/cp-frontend-rayanarssi/assets/Extra_image_3.jpg"],
		"imgsInfo": "These images have been specially designed as visual aids for an interactive retelling of the fairy tale The Little Mermaid. Most of the illustrations were created with the help of AI technology and contribute to an imaginative and immersive experience of the story.",
		"genre": "fantasie",
		"storyFrom": "H. C. Andersen"
	},
	{
		"id": "manal-boulahya-the-tale-of-the-princes-kaguya",
		"nameStudent": "Manal Boulahya",
		"fairytale": "The Tale of The Princes Kaguya",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-Manal0307/parallax",
		"fairytaleAuthor": "Isao Takahata",
		"parallaxInfo": "Mijn project maakt gebruik van parallax scrolling en zachte animaties om het verhaal visueel tot leven te brengen. Daarnaast gebruik ik animaties met Framer Motion en Motion One om scènes natuurlijk te laten binnenkomen: beelden die vloeiend verschijnen, tekst die zachtjes opduikt, en elementen zoals bladeren of sterren die langzaam bewegen. ",
		"description": "Het verhaal van Prinses Kaguya vertelt het verhaal van een klein meisje dat door een oude bamboesnijder in een gloeiende bamboestengel wordt ontdekt. Met liefde opgevoed, groeit ze uit tot een prachtige jonge vrouw. In de overtuiging dat ze een goddelijke prinses is, neemt haar adoptievader haar mee naar de hoofdstad om een nobel leven te leiden.\nOndanks rijkdom en hooggeplaatste aanbidders verlangt Kaguya terug naar haar eenvoudige jeugd op het platteland. Naarmate haar mysterieuze afkomst zich ontvouwt, moet ze haar ware identiteit en het verdriet onder ogen zien om terug te keren naar waar ze echt thuishoort.",
		"videoExplainer": "W71mtorCZDw",
		"imgThumbnail": "https://res.cloudinary.com/deq5iutqv/image/upload/v1747841386/cover_egxxh1.png",
		"imgBanner": "https://res.cloudinary.com/deq5iutqv/image/upload/v1748212736/scen6_hperio.png",
		"imgsExtra": [
			"https://res.cloudinary.com/deq5iutqv/image/upload/v1748042075/S41_anllbg.png",
			"https://res.cloudinary.com/deq5iutqv/image/upload/v1748286002/child_o3qt4d.png",
			"https://res.cloudinary.com/deq5iutqv/image/upload/v1748285323/d5e90b37-6d13-4b3c-9de4-9f3cb0a8a432_dmjoh1.png"
		],
		"imgsInfo": "De afbeeldingen volgen een rijk geïllustreerde, digitale 2D-verhaalboekstijl, geïnspireerd op moderne sprookjes. De beelden combineren levendige, contrasterende kleuren met zachte gradiënten en subtiele texturen (vaak korrelig), wat een ambachtelijke uitstraling creëert. De personages zijn expressief en hebben grote ogen met emotionele diepte, terwijl de achtergronden gestileerde natuurlijke elementen zoals bamboebossen, nachtelijke luchten en weelderige planten combineren. De algehele esthetiek is sfeervol, poëtisch en filmisch - perfect geschikt voor verhalende verhalen zoals Het verhaal van Prinses Kaguya of door Coraline geïnspireerde scènes.",
		"genre": "fantasie",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "younes-ben-ali-aladin-en-de-wonderlamp",
		"nameStudent": "Younes Ben Ali",
		"fairytale": "Aladin en de wonderlamp",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-YounesEHB2023/Parallax",
		"fairytaleAuthor": "Arabische afkomst, vertaald door Antoine Galland.",
		"parallaxInfo": "Stap de bruisende straten van Agrabah binnen, waar Aladdins avontuur tot leven komt in lagen van magie en mysterie. Zie de wonderlamp in de verte glinsteren terwijl goudkleurig zand om je heen wervelt, terwijl geesten en magische tapijten door de lucht zweven. Terwijl je scrollt, brult de Grot der Wonderen open en fonkelen juwelen met verborgen geheimen over de wereld van front-end betovering. Met parallaxrollen en geanimeerde verwondering wordt dit verhaal niet alleen verteld - het wordt geleefd.",
		"description": "Stap de bruisende straten van Agrabah binnen, waar Aladdins avontuur tot leven komt in lagen van magie en mysterie. Zie de wonderlamp in de verte glinsteren terwijl goudkleurig zand om je heen wervelt, terwijl geesten en magische tapijten door de lucht zweven. Terwijl je scrollt, brult de Grot der Wonderen open en fonkelen juwelen met verborgen geheimen over de wereld van front-end betovering. Met parallaxrollen en geanimeerde verwondering wordt dit verhaal niet alleen verteld - het wordt geleefd.",
		"videoExplainer": "I4KTlQHzvas",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-YounesEHB2023/Thumbnail.png",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-YounesEHB2023/BannerAladdin.png",
		"imgsExtra": ["", "", ""],
		"imgsInfo": "De afbeeldingen zijn gedownload van de website vecteezy. Voor de rest heb ik de afbeeldingen (vectoren) in lagen opgebouwd om een parallax-effect te creëren. De afbeeldingen zijn ook gekozen om een Arabische/klassieke sfeer te creëren.",
		"genre": "fantasie",
		"storyFrom": "Duizend-en-één-nacht"
	},
	{
		"id": "arno-baeck-hans-en-grietje",
		"nameStudent": "Arno Baeck",
		"fairytale": "Hans en Grietje",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-ArnoBaeck/#/fairytale",
		"fairytaleAuthor": "De Gebroeders Grimm",
		"parallaxInfo": "Om Hans en Grietje tot leven te brengen, gebruikte ik parallax-effecten, Framer Motion-animaties en ondersteunende geluidseffecten. De parallax creëert diepte terwijl gebruikers door de scènes scrollen, terwijl Framer Motion vloeiende, magische overgangen toevoegt, zoals deuren die opengaan of personages die bewegen. Geluidseffecten worden geactiveerd door te scrollen of te klikken om belangrijke momenten te versterken, waardoor het sprookje meeslepend en interactief aanvoelt.",
		"description": "Stap het betoverde bos in en ontdek het creatieve proces achter mijn herinterpretatie van het klassieke sprookje Hans en Grietje. In dit project bracht ik het verhaal tot leven met een persoonlijke twist – door een magische sfeer en subtiele verrassingen toe te voegen die de ervaring nieuw, maar toch nostalgisch maken. \nDoor gebruik te maken van gelaagde parallax-effecten komen de scènes tot leven terwijl je beweegt, wat een gevoel van diepte en immersie creëert. Zorgvuldig gekozen geluidseffecten begeleiden de reis en versterken elk moment - an ritselende bladeren tot de griezelige stilte van het met snoep bedekte bos. \nDeze pagina biedt een kijkje achter de schermen en laat zien hoe ik een tijdloos verhaal heb getransformeerd tot een interactief visueel verhaal, waarbij ik storytelling, animatie en geluid heb gecombineerd tot één naadloze ervaring.",
		"videoExplainer": "pFy3Wnmchd8",
		"imgThumbnail": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ArnoBaeck/refs/heads/main/public/dummyData-Sprookjes/hans-en-grietje.png",
		"imgBanner": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ArnoBaeck/refs/heads/main/public/dummyData-Sprookjes/hansel_and_gretel_banner.png",
		"imgsExtra": [
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ArnoBaeck/refs/heads/main/public/extra_image01.png",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ArnoBaeck/refs/heads/main/public/extra_image02.png",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ArnoBaeck/refs/heads/main/public/extra_image03.png"
		],
		"imgsInfo": "De meeste visuele elementen in dit sprookje heb ik zelf ontworpen, passend bij de sfeer van het verhaal. Ik heb ook een aantal Adobe Stock-bestanden gebruikt om de visuele storytelling waar nodig te ondersteunen en te versterken. Deze combinatie stelde me in staat om een unieke en samenhangende stijl te creëren gedurende het hele project.",
		"genre": "avontuur",
		"storyFrom": "Gebroeders Grimm"
	},
	{
		"id": "rey-mammadbeyli-hercules",
		"nameStudent": "Rey Mammadbeyli",
		"fairytale": "Hercules",
		"fairytaleLink": "",
		"fairytaleAuthor": "Ron Clements",
		"parallaxInfo": "Terwijl bezoekers door de site scrollen, onthult het parallax-effect geleidelijk het tijdloze verhaal van Hercules op een manier die zowel meeslepend als filmisch aanvoelt. Elke beweging naar beneden op de pagina introduceert een nieuw hoofdstuk in zijn heroïsche reis – van zijn geboorte op de berg Olympus en zijn val naar de aarde, tot zijn beproevingen, gevechten met angstaanjagende monsters en zijn uiteindelijke opkomst als een ware held. Het gelaagde scrolleffect is ontworpen om Hercules' groeipad te weerspiegelen, met voorgrond- en achtergrondelementen die met verschillende snelheden bewegen om een ​​gevoel van diepte, avontuur en transformatie te creëren. Het verhaal vloeit vloeiend over het scherm en geeft gebruikers het gevoel dat ze samen met Hercules reizen terwijl hij zijn kracht ontdekt, zijn lot omarmt en uiteindelijk zijn plaats tussen de goden verdient.",
		"description": "Hercules vertelt het verhaal van een jonge god, Hercules, die door Hades, de god van de onderwereld, van de berg Olympus wordt ontvoerd en sterfelijk wordt. Hoewel hij op aarde opgroeit, behoudt Hercules zijn goddelijke kracht. Als tiener ontdekt hij zijn ware afkomst en zet hij zich in om een ware held te worden om zijn plaats onder de goden terug te winnen. Getraind door de satyr Philoctetes ('Phil') en vergezeld door zijn vliegende paard Pegasus, komt Hercules vele uitdagingen en monsters tegen die gestuurd zijn door Hades, die Zeus ten val wil brengen. Onderweg wordt Hercules verliefd op Megara, een cynische maar goedhartige vrouw die in het geheim voor Hades werkt. Uiteindelijk bewijst Hercules dat ware heldenmoed voortkomt uit zelfopoffering - niet uit kracht - wanneer hij zijn leven riskeert om Meg te redden. Zijn moed levert hem een ​​plek op Olympus op, maar hij kiest ervoor om bij Meg op aarde te blijven, nu hij gevonden heeft waar hij echt thuishoort.",
		"videoExplainer": "8NqaX5ec_38",
		"imgThumbnail": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-reycik/refs/heads/main/hercules/public/images/thumbnail.png?token=GHSAT0AAAAAADD62OPBK3PGLUWU2GFD2S542BU5R5A",
		"imgBanner": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-reycik/refs/heads/main/hercules/public/images/banner.png?token=GHSAT0AAAAAADD62OPA25SSJPZTBGXWAV7G2BU5SWQ",
		"imgsExtra": [
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-reycik/refs/heads/main/hercules/public/images/reference1.png?token=GHSAT0AAAAAADD62OPA527MO2TP7EWG7HKG2BU5NGQ",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-reycik/refs/heads/main/hercules/public/images/reference2.png?token=GHSAT0AAAAAADD62OPBB67MSR35MSJZTOZC2BU5O7A",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-reycik/refs/heads/main/hercules/public/images/reference3.png?token=GHSAT0AAAAAADD62OPBONYNV3HAWPMRKOVA2BU5UGA",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-reycik/refs/heads/main/hercules/public/images/reference4.png?token=GHSAT0AAAAAADD62OPALNQC7XL3P2WBF2NQ2BU5VGQ"
		],
		"imgsInfo": "De visuele identiteit van de website komt tot leven door een verzameling originele illustraties, zorgvuldig vervaardigd met behulp van Adobe Illustrator. Elk grafisch element is ontworpen om de dynamische energie en gestileerde esthetiek van Disney's Hercules te weerspiegelen, maar ook een persoonlijke artistieke touch te geven. Geïnspireerd door oud-Grieks aardewerk, heroïsche proporties en levendige mythologische motieven, helpen de illustraties de toon te zetten voor elk deel van het verhaal. Personages worden afgebeeld met expressieve, krachtige lijnen, met een balans tussen detail en eenvoud die de beweging van het parallax-effect complementeert. Van de iconische bliksemschichten van Zeus tot de schimmige figuren van Hades en zijn handlangers, elke afbeelding versterkt het verhaal en houdt de kijker betrokken bij de fantasiewereld van goden, monsters en legendes.",
		"genre": "mythologie",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "ramon-de-raes-de-wolf-en-de-3-biggetjes",
		"nameStudent": "Ramon De Raes",
		"fairytale": "De wolf en de 3 biggetjes",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-ramon337/#/fairytale",
		"fairytaleAuthor": "Joseph Jacobs",
		"parallaxInfo": "Deze parallaxwebsite vertelt het klassieke sprookje van de drie biggetjes met een visueel meeslepende scroll-ervaring. Terwijl je scrollt, bewegen achtergrondlagen op verschillende snelheden voor een diepte-effect. Interactieve animaties, zoals de wolf die blaast en het huis dat instort, maken het verhaal levendig en speels.",
		"description": "Er waren eens drie biggetjes die op een dag besloten hun eigen huisjes te bouwen. Elk van hen koos een ander materiaal: stro, hout en steen. Ze wilden een veilig plekje om te wonen, ver weg van de gevaarlijke boze wolf die in het bos rondzwierf. Wat ze niet wisten, was dat hun keuzes hen al snel op de proef zouden stellen…",
		"videoExplainer": "-gdcgnSrUvU",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-ramon337/tumbnail.png",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-ramon337/banner.png",
		"imgsExtra": ["https://ehb-mct.github.io/cp-frontend-ramon337/extra1.png", "https://ehb-mct.github.io/cp-frontend-ramon337/extra2.png", "https://ehb-mct.github.io/cp-frontend-ramon337/extra3.png"],
		"imgsInfo": "De afbeeldingen bestaan uit gelaagde elementen zoals een bosachtergrond, grond, voorgrond en de drie biggetjes die samen een parallaxeffect creëren. Elke big bouwt een uniek huis: een van stro, hout en steen, elk weergegeven met gedetailleerde illustraties. ",
		"genre": "avontuur",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "laura-ocampo-peter-pan",
		"nameStudent": "Laura Ocampo",
		"fairytale": "Peter Pan",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-lauraocampogil/#/firstpageparallax",
		"fairytaleAuthor": "Sir James Matthew Barrie",
		"parallaxInfo": "De parallax-effecten zijn gemaakt met react-spring/parallax. Het animeren gaat voor mij veel eenvoudiger op deze manier, omdat ik per element een offset kan instellen en elk element een aparte ParallaxLayer geef, met hun eigen tijd op het scherm. \nDe beelden zijn bewerkt in Photoshop en gegenereerd met behulp van ChatGPT. Er is gebruikgemaakt van verschillende parallax-technieken, waaronder een gelaagde parallax en een mouse-parallax. Daarnaast is er ook een custom cursor van TinkerBell toegevoegd — en niet te vergeten: de muziek.",
		"description": "Ga mee op een magische reis door Peter Pans betoverende wereld in deze meeslepende parallaxervaring. Van de kinderkamer van Darling tot het mysterieuze eiland Nooitgedachtland, waar bij elke scroll een avontuur wacht. Ontmoet de energieke Lost Boys, trotseer de dreigende piraten van Kapitein Haak aan boord van de Jolly Roger en volg Tinkerbells cursor en magische toverstaf door de bossen en kristalheldere lagunes. Vergeet niet je geluid aan te zetten voor de volledige betovering – de Lost Boys en Peter Pan wachten op je!",
		"videoExplainer": "nDM499ppEWk",
		"imgThumbnail": "https://res.cloudinary.com/dyioqqptt/image/upload/v1747814791/Peter_Pan_gbid8m.jpg",
		"imgBanner": "https://res.cloudinary.com/dyioqqptt/image/upload/v1747814930/Banner-peterpan_k3h1dn.png",
		"imgsExtra": [
			"https://res.cloudinary.com/dyioqqptt/image/upload/v1747815240/Gekidnapped_kqdjcr.png",
			"https://res.cloudinary.com/dyioqqptt/image/upload/v1747815360/HaakVSPeterzonderZwaard_bepj6t.png",
			"https://res.cloudinary.com/dyioqqptt/image/upload/v1747815375/Starwithstars_vgnpiu.png"
		],
		"imgsInfo": "De beelden zijn gemaakt met ChatGPT. Ik heb gekozen voor de Ghibli-stijl, die op dat moment erg populair was. Daardoor kregen de figuren een soort animé-uitstraling.",
		"genre": "fantasie",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "matteo-giambarresi-de-raaf-en-de-vos",
		"nameStudent": "Matteo Giambarresi",
		"fairytale": "De raaf en de vos",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-MatteoGiambarresi/parallax",
		"fairytaleAuthor": "Jean de la Fontaine",
		"parallaxInfo": "Mijn parallax website is gemaakt met framer-motion en react-spring, Met react-spring heb ik doorheen mijn volledige website verticale-parallax gebruikt dankzij de ParallaxLayer component. Met framer-motion heb ik de animaties waarbij ik de whileInView veel gebruik zodat de animatie alleen gebeurt wanneer de user het element ziet,",
		"description": "De Raaf en de Vos is een dierenfabel geschreven door Jean de La Fontaine. In dit verhaal laat de schrijver dieren praten en handelen als mensen. Een ijdele raaf zit op een tak met een stuk kaas in zijn bek. Een sluwe vos wil de kaas en vleit de raaf door te zeggen hoe prachtig hij is en hoe mooi hij vast kan zingen. De raaf laat zich vangen door de vleierij, opent zijn snavel om te zingen, en laat zo de kaas vallen - precies wat de vos wilde.\nDe fabel eindigt met een duidelijke moraal: Wees op je hoede voor vleiers.",
		"videoExplainer": "0o4bHaYMAw4",
		"imgThumbnail": "https://res.cloudinary.com/dhvigmhgw/image/upload/v1747820174/cover_raaf_en_de_vos_rzi5d6.png",
		"imgBanner": "https://res.cloudinary.com/dhvigmhgw/image/upload/v1747822114/banner_raaf_en_de_vos_ubkodp.png",
		"imgsExtra": [
			"https://res.cloudinary.com/dhvigmhgw/image/upload/v1747822731/tree_dewmx9.png",
			"https://res.cloudinary.com/dhvigmhgw/image/upload/v1747822731/wolf_1_dsf1ox.png",
			"https://res.cloudinary.com/dhvigmhgw/image/upload/v1747822731/bird_1_swxd7n.png"
		],
		"imgsInfo": "De beelden zijn gemaakt met Illustrator, ik heb silhouetten gevonden en deze hermaakt in illustrator. Voor de boom heb ik een image gevonden op pinterest en deze gevectoriseerd",
		"genre": "dierenverhaal",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "joel-lopez-mendez-raponsje",
		"nameStudent": "Joel Lopez Mendez",
		"fairytale": "Raponsje",
		"fairytaleLink": "",
		"fairytaleAuthor": "De Gebroeders Grimm",
		"parallaxInfo": "",
		"description": "Dit is het klassieke sprookje van Raponsje. \nDit verhaal begon met een vrouw die zwanger was en zo graag raponsjes wilde. In de tuin van een naburige heks waren er raponsjes. Haar man pakte er een, maar werd betrapt. De heks eiste als straf het ongeboren kind op. Na de geboorte neemt de heks het kind mee en noemt haar Raponsje. Wanneer Raponsje twaalf jaar wordt, sluit de heks haar op in een toren. De toren heeft geen deuren of trappen; de enige manier om binnen te komen is door naar boven te klimmen via haar lange, magische haar. \nOp een dag hoort een prins Raponsje zingen en ontdekt de toren. Hij klimt naar binnen en ze worden verliefd. Wanneer de heks achter hun geheime ontmoeting komt, knipt ze Raponsjes haar af en verbant haar naar een woestenij. Wanneer de prins de toren opnieuw bezoekt, verrast de heks hem en hij valt in de struiken met doorns, waardoor hij blind wordt. \nJaren gaan voorbij, en de prins, die door de wereld zwerft, vindt Raponsje terug. Haar tranen genezen zijn ogen en kan opnieuw  zien. Ondertussen hebben zij ook een tweeling gekregen, en samen met de prins reist ze terug naar zijn koninkrijk om gelukkig verder te leven.",
		"videoExplainer": "",
		"imgThumbnail": "",
		"imgBanner": "",
		"imgsExtra": ["", "", ""],
		"imgsInfo": "",
		"genre": "fantasie",
		"storyFrom": "Gebroeders Grimm"
	},
	{
		"id": "siriyakorn-klaklang-duimelijntje",
		"nameStudent": "Siriyakorn Klaklang",
		"fairytale": "Duimelijntje",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-MeoKlaklang/#/duimelijntje",
		"fairytaleAuthor": "Hans Christian Andersen, 1836",
		"parallaxInfo": "We openen met een mouse-follow parallax, waarin een bloem zacht meebeweegt met de cursor. Zodra de bloem opengaat, opent Duimelijntje haar ogen in een subtiele loopanimatie, waarmee haar geboorte wordt gesuggereerd. \nVerderop verschijnt de koning-kikker, verborgen achter bladeren die via een drag-interactie kunnen worden weggesleept. Deze actie triggert een geluidseffect van kwakende kikkers, wat de ontdekking auditief ondersteunt. \nIn de volgende scène zitten de prins-kikker en Madelijntje samen op een lelieblad in een rustig waterlandschap. Door op de kikker te klikken, activeer je een animatie waarin vissen opduiken en de situatie verstoren — een interactief moment dat spanning opbouwt. \nWanneer je over Madelijntje hovert, verschijnen vlinders die haar zachtjes omringen in een hover-triggered emergence, wat visueel haar redding verbeeldt. \nDe scène verschuift naar een groep vogels die haar vergezellen. Deze vogels reageren op muisbeweging met verticale parallax-bewegingen. Een klik op de blauwe vogel zorgt ervoor dat deze uit de boom valt in een dramatische valanimatie, versterkt door geluid. \nDe ervaring eindigt in een multi-layered scroll parallax, waarbij vlinders langs het scherm fladderen en sterren subtiel pulseren op het ritme van een begeleidende soundscape. Deze dynamische finale sluit het verhaal af in een betoverende visuele climax.",
		"description": "Duimelijntje, een piepklein meisje geboren uit een bloem, wordt ontvoerd door een pad die haar wil uithuwelijken aan haar lelijke zoon. Met hulp van vissen en een vlinder ontsnapt ze. Daarna wordt ze meegenomen door een kever, maar verstoten omdat ze geen voelsprieten heeft. \nZe overleeft de zomer in het bos, maar als de winter komt, vindt een veldmuis haar en biedt haar onderdak. De veldmuis wil haar uithuwelijken aan een blinde, sombere mol. In de ondergrondse gangen verzorgt Duimelijntje in het geheim een zieke zwaluw, die later naar het zuiden vliegt. \nTussen de bloemenontmoet ze de bloemenkoning, met wie ze trouwt en gelukkig leeft zwaluw terug en neemt haar mee naar een zonnig land. Daar Als Duimelijntje gedwongen wordt met de mol te trouwen, keert de zwaluw terug en neemt haar mee naar een zonnig land. Daar ",
		"videoExplainer": "iG_hLLr6B7k",
		"imgThumbnail": "https://res.cloudinary.com/dpisu7cdm/image/upload/v1747240114/cx25j1ytaeit1gu5aaa6.jpg",
		"imgBanner": "https://res.cloudinary.com/dpisu7cdm/image/upload/v1747814740/Firefly_een_lelie_blad_20986_w6ujm5.jpg",
		"imgsExtra": [
			"https://res.cloudinary.com/dpisu7cdm/image/upload/v1747240116/jxxo1oxb987cizvgzma1.jpg",
			"https://res.cloudinary.com/dpisu7cdm/image/upload/v1747240114/uhudl2sx5mrki22slwo7.jpg",
			"https://res.cloudinary.com/dpisu7cdm/image/upload/v1747240113/essikhz9cgr1szptectc.jpg"
		],
		"imgsInfo": "Deze illustratie heb ik gemaakt met behulp van Adobe Firefly. Ik vond deze stijl heel passend bij de sfeer van klassieke sprookjes, zoals het verhaal van Duimelijntje. Het zachte kleurgebruik, de dromerige details en de magische uitstraling van het kleine elfje sluiten perfect aan bij die betoverende wereld vol wonderlijke wezentjes en kleine avonturen.",
		"genre": "avontuur",
		"storyFrom": "H. C. Andersen"
	},
	{
		"id": "nina-breedstraet-de-waternimf-in-de-vijver",
		"nameStudent": "Nina Breedstraet",
		"fairytale": "De waternimf in de vijver",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-NinaBreedstraet/deWaternimfInDeVijver",
		"fairytaleAuthor": "De Gebroeders Grimm",
		"parallaxInfo": "Voor dit project heb ik Framer Motion gecombineerd met een set custom React-hooks om een dynamische, scroll-afhankelijke parallax-ervaring te bouwen. In plaats van een kant-en-klare parallax-bibliotheek gebruik ik useScroll en useTransform om van elke scène de scroll-progressie om te zetten naar animatieparameters zoals grassY, textY en blurAmount. Hierdoor heb ik volledige controle over de timing en intensiteit van elke laagbeweging en blur-effect. In de eerste scène bevind je je hoog in de bergen bij een stil meer, waar je een korte introductie op het verhaal krijgt. Wanneer je verder scrolt, daal je af het bos in, omringd door de dieren. Even later opent het bladerdak zich en kom je uit bij een vijver, waarin een kam, een fluit en een spinnenwiel langzaam naar de bodem zinken. Bij de volgende scrollactie overstroomt de vijver en glijden school vissen sierlijk voorbij. Vervolgens ontvouwt zich een weids landschap, waarin je twee kikkers ziet — de verpersoonlijking van de man en de vrouw in hun transformatie. Tegen het einde keren zij terug naar hun menselijke gedaante en worden ze schapenherders, maar de omzwervingen hebben hen van elkaar vervreemd. Uiteindelijk ontmoeten ze elkaar opnieuw en bezegelen hun hereniging met een kus.",
		"description": "De waternimf in de vijver is een mooi sprookje van de Gebroeders Grimm. Het begint bij een arme molenaar die op een dag een magische nimf ziet glinsteren onder het wateroppervlak van zijn vijver. In ruil voor groot geluk belooft zij hem rijkdom… indien hij de eerstgeborene van zijn gezin aan haar afstaat. Jaren later, wanneer zijn zoon, die een jager is geworden, bij de vijver zijn handen wil wassen, grijpt de nimf hem mee de donkere diepte in. Radeloos zet zijn vrouw alles op alles om haar man te redden: ze doorstaat drie onmogelijke beproevingen waarbij een gouden kam, een betoverende fluit en een ingewikkeld spinnewiel de sleutel blijken. Maar hoe slaagt zij erin de nimf te slim af te zijn? En wat wacht hen na hun lange beproevingen? Ontdek het spannende einde van dit verhaal op mijn website…",
		"videoExplainer": "oFN-mY7HMr8",
		"imgThumbnail": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-NinaBreedstraet/refs/heads/main/public/thumbnailNina.jpeg",
		"imgBanner": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-NinaBreedstraet/refs/heads/main/public/bannerNina.jpeg",
		"imgsExtra": [
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-NinaBreedstraet/refs/heads/main/public/extraImage1Nina.jpg",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-NinaBreedstraet/refs/heads/main/public/extraImage2Nina.jpg",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-NinaBreedstraet/refs/heads/main/public/extraImage3Nina.jpg",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-NinaBreedstraet/refs/heads/main/public/extaImage4Nina.jpg",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-NinaBreedstraet/refs/heads/main/public/extraImage5Nina.jpg"
		],
		"imgsInfo": "Ik heb verschillende stockafbeeldingen gecombineerd en in Photoshop met de stempel-tool bewerkt om een zachte, dromerige sfeer te creëren, waarin alle scènes naadloos in elkaar overlopen als in een écht bos. Voor extra én verrassende details—zoals het hutje in de bergen—heb ik Adobe Firefly ingezet, wat de magische, licht mysterieuze uitstraling verder versterkt.",
		"genre": "fantasie",
		"storyFrom": "Gebroeders Grimm"
	},
	{
		"id": "luca-lattuca-de-tovenaar-van-oz",
		"nameStudent": "Luca Lattuca",
		"fairytale": "De tovenaar van Oz",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-LucaLattuca/#/story",
		"fairytaleAuthor": "Frank Baum",
		"parallaxInfo": "Het sprookje begint in Kansas, waar Dorothy en Toto meegesleurd worden door de tornado. \nDe wolken bewegen volgens een horizontale parallax aan verschillende snelheden. \nWanneer de tornado langs het scherm raast, bewegen Dorothy en Toto volgens een multidirectionele parallax die hun in de lucht zwiert. \nVervolgens zien we het huis van dorothy die door de lucht zweeft naast de tornado volgens een horizontale parallax. De achtergrondkleur verandert en de elementen krijgen kleur. \nDorothy en Toto landen in het magische land van oz, waar hun huis is geland in Munchkinland. Daar ontmoeten ze de goede heks van het zuiden die haar de rode slippers geeft. Een rollover animatie op het raam toont Toto. Dorothy en Toto vertrekken naar de smaragden stad om de tovenaar van oz te vragen om hun terug thuis te brengen volgens een horizontale parallax.",
		"description": "De tovenaar van Oz vertelt het verhaal van Dorothy Gale, een jong meisje dat op een boerderij in Kansas woont en door een tornado wordt meegesleurd naar het magische land Oz. In Oz komen zij en haar hond Toto verschillende personages tegen, waaronder de Vogelverschrikker, de Blikken Houthakker en de Laffe Leeuw, die elk een wens van de Tovenaar van Oz willen. Dorothy en haar vrienden moeten over de Gele Bakstenen Weg naar de Smaragden Stad reizen om de Tovenaar van Oz te ontmoeten. Onderweg komen ze uitdagingen en gevaren tegen, waaronder de Boze Heks van het Westen, die vastbesloten is om Dorothy's robijnrode muiltjes te bemachtigen.",
		"videoExplainer": "PSZxmZmBfnU",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-LucaLattuca/thumbnail.jpg",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-LucaLattuca/banner.jpg",
		"imgsExtra": ["https://ehb-mct.github.io/cp-frontend-LucaLattuca/extra-1.png", "https://ehb-mct.github.io/cp-frontend-LucaLattuca/extra-2.webp", "https://ehb-mct.github.io/cp-frontend-LucaLattuca/extra-3.png"],
		"imgsInfo": "De afbeeldingen voor huizen en schtergronden in dit sprookje zijn online gevonden. de personnages zijn gegenereerd met artificiële  intelligentie en zijn naderhand aangepast door ze in te kleuren en om ze om te kunnen laten bewegen. De rest van de afbeeldingen en achtergronden zijn in Adobe Illustrator gemaakt. ",
		"genre": "avontuur",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "fleur-van-de-ville-rapunzel",
		"nameStudent": "Fleur Van De Ville",
		"fairytale": "Rapunzel",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-FleurVanDeVille/#/sprookje",
		"fairytaleAuthor": "De Gebroeders Grimm",
		"parallaxInfo": "Op mijn parallax-pagina gebruik ik scrollgestuurde animaties om beweging en diepte te creëren. Bomen bewegen naar voren, personages verschijnen vanaf verschillende kanten in beeld en lantaarns stijgen op. Bij het scrollen komen Flynn en Rapunzel samen, rollen tranen over een gezicht en beweegt de achtergrond mee. Ook zijn er interactieve elementen: je kunt figuren verplaatsen en mogelijk geluid activeren, wat zorgt voor een meeslepende en emotionele beleving.",
		"description": "Rapunzel is een prinses met magisch, goud haar dat kan genezen. Als baby wordt ze ontvoerd door Moeder Gothel, die haar in een toren opsluit om jong te blijven. Op haar achttiende verjaardag wil Rapunzel de mysterieuze lichtjes zien die elk jaar in de lucht verschijnen. Wanneer de dief Flynn Rider haar toren binnenkomt, grijpt ze haar kans om de wereld buiten te ontdekken. Tijdens hun avontuur leert ze de waarheid over haar verleden en vindt ze haar echte familie terug.",
		"videoExplainer": "So9o_CROe_Y",
		"imgThumbnail": "https://res.cloudinary.com/drfkgbixt/image/upload/v1747767685/image_13445806_ntjxsn.jpg",
		"imgBanner": "https://res.cloudinary.com/drfkgbixt/image/upload/v1747767674/8543_1920x1080_uwle22.jpg",
		"imgsExtra": [
			"https://res.cloudinary.com/drfkgbixt/image/upload/v1747767946/c089592821a61e9fbca23ed6fd91cd05_ld13rm.jpg",
			"https://res.cloudinary.com/drfkgbixt/image/upload/v1747767973/Tower.01.PNG_ygeavg.webp",
			"https://res.cloudinary.com/drfkgbixt/image/upload/v1747767961/rapuncel-hameleon-paskal-616_rugnn0.webp"
		],
		"imgsInfo": "De beelden zijn gegenereerd in MidJourney. Ik heb gekozen voor een stijl met een sprookjesachtige sfeer, zachte belichting en expressieve, handgetekende karakters. Door deze stijl krijgen de scènes een romantische, nostalgische uitstraling, alsof ze afkomstig zijn uit een oude animatiefilm. De warme kleuren en gedetailleerde omgevingen versterken het magische gevoel van het verhaal.",
		"genre": "avontuur",
		"storyFrom": "Gebroeders Grimm"
	},
	{
		"id": "beatrice-bjoko-de-vuurvogel",
		"nameStudent": "Béatrice Bjoko",
		"fairytale": "De vuurvogel",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-BeatriceBjoko/sprookje",
		"fairytaleAuthor": "Bette Westera",
		"parallaxInfo": "Het sprookje bestaat uit meerdere scènes waarin ik gebruik heb gemaakt van GSAP-animaties, parallax scrolling, interactieve elementen en visuele effecten om de beleving tot leven te brengen. \nElke scène bevat scrol-geactiveerde tekstanimaties, die woord voor woord verschijnen dankzij de GSAP ScrollTrigger plugin.",
		"description": "De Vuurvogel is een betoverend sprookje over een magische, vurige vogel met gloeiende veren die in het donker schitteren. In het verhaal gaat een jonge held op zoek naar dit mythische wezen, dat vaak symbool staat voor hoop, vernieuwing of genezing. Onderweg komt hij voor moeilijke keuzes te staan, trotseert hij gevaar en leert hij belangrijke lessen over moed, liefde en opoffering. Het verhaal vindt zijn oorsprong in de Russische folklore en staat bekend om zijn mysterieuze, poëtische toon en rijke, wonderlijke beeldtaal.",
		"videoExplainer": "4f4stmTZrkY",
		"imgThumbnail": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-BeatriceBjoko/refs/heads/main/public/assets/thumbnail_devuurvogel.png",
		"imgBanner": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-BeatriceBjoko/refs/heads/main/public/assets/vuurvogel-banner.png",
		"imgsExtra": [
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-BeatriceBjoko/refs/heads/main/public/assets/extra-image1.png",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-BeatriceBjoko/refs/heads/main/public/assets/extra-image2.png",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-BeatriceBjoko/refs/heads/main/public/assets/extra-image3.png"
		],
		"imgsInfo": "Voor mijn parallaxproject heb ik gekozen voor een oil paint geïnspireerde stijl.De achtergronden en visuele assets, zoals het hekwerk, de appelbomen en de paddenstoelen, hebben een geschilderde look.",
		"genre": "magie",
		"storyFrom": "uit Rusland"
	},
	{
		"id": "maxim-westerbeek-duimelijntje",
		"nameStudent": "Maxim Westerbeek ",
		"fairytale": "Duimelijntje",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-MaximWesterbeek/parallaxPage",
		"fairytaleAuthor": "Hans Christian Andersen, 1836",
		"parallaxInfo": "Ik heb in mijn project verschillende parallax effecten gebruikt, waaronder horizontale, verticale en gelaagde parallax. Het begint en eindigd met een 'wipe' effect wat een leuke overgang geeft van de zogezegde 'cover' naar het verhaal zelf en dan op het einde weer naar deze 'cover. De rest van de parallax-effecten heb ik doorheen het sprookje gebruikt om het verhaal interessant en interactief te houden.",
		"description": "Er was eens een klein meisje, niet groter dan een duim, dat uit een bloem werd geboren. Haar leven begon wondermooi, maar al gauw werd zij weggerukt door een lelijke pad die haar met zijn zoon wilde huwen. Zo begon voor Duimelijntje een lange reis vol gevaren en verdriet. Ze werd ontvoerd door een kever, leefde eenzaam in het bos, en moest schuilen voor de kou bij een veldmuis, die haar uithuwelijken wilde aan een rijke, maar saaie mol. Toch bleef haar hart verlangen naar licht, vrijheid en liefde. Dankzij een zwaluw die zij in de winter liefdevol verzorgde, nam die haar vóór het huwelijk mee. Vond zij uiteindelijk haar geluk in een warm land, waar zij trouwde met een prins van haar eigen grootte en naam kreeg als een de bloemenkoningin. En daar leefde zij gelukkig, in zon en bloemen, voor altijd.",
		"videoExplainer": "mBd1Q5rTnh4",
		"imgThumbnail": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-MaximWesterbeek/refs/heads/main/course-project/public/assets/thumbnail_maxim-westerbeek.jpg",
		"imgBanner": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-MaximWesterbeek/refs/heads/main/course-project/public/assets/banner_maxim-westerbeek.jpg",
		"imgsExtra": [
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-MaximWesterbeek/refs/heads/main/course-project/public/assets/extra-img-1_maxim-westerbeek.jpg",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-MaximWesterbeek/refs/heads/main/course-project/public/assets/extra-img-2_maxim-westerbeek.jpg",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-MaximWesterbeek/refs/heads/main/course-project/public/assets/extra-img-3_maxim-westerbeek.jpg"
		],
		"imgsInfo": "Ik heb illustraties uit een russische versie van het verhaal Duimelijntje 'дюймовочка' gebruikt. Het boek is geïllustreerd door Natalia Akimova uit Moscou, Rusland. \nIk vertikte AI te gebruiken. Hoe meer ik erover leer, hoe minder ik het wil gebruiken. Het is verschrikkelijk hoeveel artiesten hun werk gestolen wordt, ik kan geen generatieve AI meer gebruiken zonder mij slecht te voelen. AI hoort repetitief en vervelend werk te doen, niet juist hetgene wat ons menselijk maakt, niet zogezegd 'kunst' maken.",
		"genre": "avontuur",
		"storyFrom": "H. C. Andersen"
	},
	{
		"id": "seppe-ghekiere-de-witte-slang",
		"nameStudent": "Seppe Ghekiere",
		"fairytale": "De witte slang",
		"fairytaleLink": "",
		"fairytaleAuthor": "De Gebroeders Grimm",
		"parallaxInfo": "",
		"description": "De witte slang, die een diepgaande liefde heeft voor de koning, leeft samen met hem in vrede, zonder dat hij weet van haar ware aard. Echter, haar geheim wordt ontdekt door een boeddhistische monnik, meestal Fa Hai, die de vrouw als een gevaar beschouwt vanwege haar natuur als geest. Fa Hai probeert hun relatie te verstoren door de waarheid over haar identiteit te onthullen.",
		"videoExplainer": "",
		"imgThumbnail": "https://ehb-mct.github.io/cp-frontend-SeppeGhekiere/thumbnail.png",
		"imgBanner": "https://ehb-mct.github.io/cp-frontend-SeppeGhekiere/de_koning_en_de_witte_slang_banner",
		"imgsExtra": ["https://ehb-mct.github.io/cp-frontend-SeppeGhekiere/extra_image_1.png", "https://ehb-mct.github.io/cp-frontend-SeppeGhekiere/extra_image_2.png", "https://ehb-mct.github.io/cp-frontend-SeppeGhekiere/extra_image_3.png"],
		"imgsInfo": "",
		"genre": "fantasie",
		"storyFrom": "Gebroeders Grimm"
	},
	{
		"id": "staf-dierickx-aladin-en-de-wonderlamp",
		"nameStudent": "Staf Dierickx",
		"fairytale": "Aladin en de wonderlamp",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-StafDierickx/paralax",
		"fairytaleAuthor": "Arabische afkomst, vertaald door Antoine Galland.",
		"parallaxInfo": "Elk paneel bevat een unieke animatie die het verhaal tot leven brengt en extra dynamiek toevoegt aan de vertelling. Door gebruik te maken van parallax-effecten ontstaat er diepte tussen de kleurrijke voorgrond en de monochrome achtergronden. Elk paneel schuift vloeiend in en uit beeld via scrollanimaties, waardoor de kijker een gevoel van beweging en vooruitgang ervaart.",
		"description": "Een jonge avonturier die door een mysterieuze tovenaar wordt uitgestuurd om een magische lamp te vinden in een verborgen grot vol rijkdommen. Na het ontdekken van de lamp en het oproepen van een geest, begint zijn reis pas echt.",
		"videoExplainer": "",
		"imgThumbnail": "https://media.githubusercontent.com/media/EHB-MCT/cp-frontend-StafDierickx/main/public/thumbnail.png",
		"imgBanner": "https://media.githubusercontent.com/media/EHB-MCT/cp-frontend-StafDierickx/main/public/cover.png",
		"imgsExtra": [
			"https://media.githubusercontent.com/media/EHB-MCT/cp-frontend-StafDierickx/main/public/extra-img-1.png",
			"https://media.githubusercontent.com/media/EHB-MCT/cp-frontend-StafDierickx/main/public/extra-img-2.png",
			"https://media.githubusercontent.com/media/EHB-MCT/cp-frontend-StafDierickx/main/public/extra-img-3.png"
		],
		"imgsInfo": "Deze reeks afbeeldingen vormt een klassieke, handgetekende vertelling in oosterse stijl. De achtergronden zijn in zwart-wit uitgevoerd met een pen-en-inkt techniek en tonen locaties zoals een woestijn, markt, paleispoort en mysterieuze grot. De personages en objecten zijn met kleur geïllustreerd om ze visueel naar de voorgrond te brengen en een duidelijk contrast te vormen met de achtergronde",
		"genre": "fantasie",
		"storyFrom": "Duizend-en-één-nacht"
	},
	{
		"id": "eren-sahbaz-keloglan",
		"nameStudent": "Eren Sahbaz",
		"fairytale": "Keloğlan",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-ErenSahbaz1/#/cp-frontend-ErenSahbaz1/parallax",
		"fairytaleAuthor": "Turkse en Altaïsche mythologie, sprookjes en soortgelijke volksverhalen.",
		"parallaxInfo": "Vertical parallax, mouse parallax",
		"description": "Keloğlan, wat 'kale jongen' betekent, is een centrale figuur in vele Turkse volksverhalen. In één van deze verhalen besluit Keloglan, een arme maar moedige jongeman, om de man van een reuzin te worden. Hij verlaat zijn moeder en gaat op avontuur, waarbij hij uiteindelijk de reuzin verslaat met behulp van een egel en als held terugkeert naar huis.",
		"videoExplainer": "UX-rZ-0uGVM",
		"imgThumbnail": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ErenSahbaz1/refs/heads/main/public/cover_eren.png",
		"imgBanner": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ErenSahbaz1/refs/heads/main/public/banner_eren.png",
		"imgsExtra": [
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ErenSahbaz1/refs/heads/main/public/extra_eren1.png",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ErenSahbaz1/refs/heads/main/public/extra_eren2.png",
			"https://raw.githubusercontent.com/EHB-MCT/cp-frontend-ErenSahbaz1/refs/heads/main/public/extra_eren3.png"
		],
		"imgsInfo": "Low poly 3D models",
		"genre": "avontuur",
		"storyFrom": "andere sprookjes"
	},
	{
		"id": "igor-lopes-oliveira-jaap-en-de-bonenstaak",
		"nameStudent": "Igor Lopes Oliveira",
		"fairytale": "Jaap en de bonenstaak",
		"fairytaleLink": "https://ehb-mct.github.io/cp-frontend-IgorLopesOliveira/sprookje",
		"fairytaleAuthor": "Benjamin Tabart / Joseph Jacobs",
		"parallaxInfo": "Deze interactieve scroll-based website vertelt Jack en de Bonenstaak na als een verticale reis. Terwijl je omhoog scrollt, ontvouwt Jacks verhaal zich - van het ruilen van de koe tot het beklimmen van de bonenstaak, het bereiken van het luchtkasteel en het ontsnappen aan de reus - in één vloeiende ervaring. Een verticale gradiëntachtergrond weerspiegelt Jacks klim, met parallaxlagen (wolken, bomen, bergen) die diepte toevoegen. Jack blijft gecentreerd en zijn sprite verandert per scène voor beweging. Dialogen verschijnen in zwevende tekstwolken, terwijl klikbare gouden eieren een geheime 'Gouden Hemel'-scène ontgrendelen. Zachte, herhalende muziek versterkt de immersie, met de mogelijkheid om het geluid te dempen. Gebouwd met React en Vite, combineert het project storytelling, animatie en modulaire webontwikkeling om een klassiek verhaal opnieuw te beleven in een boeiend, modern formaat.",
		"description": "Jaap woont samen met zijn moeder en hun enige koe. Op een dag ruilt hij de koe voor magische bonen. Zijn moeder is woedend en gooit de bonen uit het raam. 's Nachts groeit er een gigantische bonenstaak tot in de wolken. Jaap klimt omhoog en ontdekt een kasteel in de lucht, waar een reus woont samen met een kip die gouden eieren legt en een magische harp. Jaap steelt de schatten, vlucht terug naar beneden en hakt de bonenstaak om, waardoor de reus valt. Vanaf dan leven Jaap en zijn moeder in rijkdom en geluk.",
		"videoExplainer": "_X2czhUmok4",
		"imgThumbnail": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-IgorLopesOliveira/refs/heads/main/cp-igor/public/images/thumbnail-jack.png",
		"imgBanner": "https://raw.githubusercontent.com/EHB-MCT/cp-frontend-IgorLopesOliveira/refs/heads/main/cp-igor/public/images/banner-jack.png",
		"imgsExtra": [
			"https://github.com/EHB-MCT/cp-frontend-IgorLopesOliveira/blob/main/cp-igor/public/images/extraImage1.png",
			"https://github.com/EHB-MCT/cp-frontend-IgorLopesOliveira/blob/main/cp-igor/public/images/extraImage2.png",
			"https://github.com/EHB-MCT/cp-frontend-IgorLopesOliveira/blob/main/cp-igor/public/images/extraImage3.png"
		],
		"imgsInfo": "Alle beelden zijn ofwel zelfgemaakt in Adobe Illustrator of aangepast van gratis bronnen (zoals Unsplash, Pixabay), vaak handmatig gevectoriseerd om aan te sluiten bij de stijl van het project. Geïnspireerd door NASA Prospect, maakt het project gebruik van storytelling met verticale scrollbewegingen, navigatie met vaste tekens en parallaxlagen om een meeslepende ervaring te creëren. Hoewel het verhaal verschilt, is dezelfde creatieve benadering behouden. Dit is gemaakt voor educatieve doeleinden, met de nodige aandacht voor licenties. Bronnen zijn op aanvraag beschikbaar.",
		"genre": "fantasie",
		"storyFrom": "andere sprookjes"
	}
]
